package com.wyl.exercises.AlgorithmProblem;

import java.util.Scanner;

/**
 * 题目描述
 * 企业发放的奖金根据利润I提成。
 *
 * 利润I低于或等于100000元的，奖金可提10%;
 * 利润高于100000元，低于或等于200000元（100000<I≤200000）时，低于等于100000元部分按10％提成，高于100000元的部分，可提成 7.5%;
 * 200000<I≤400000时，低于200000元部分仍按上述办法提成（下同），高于200000元的部分按5％提成；
 * 400000<I≤600000元时，高于400000元的部分按3％提成；
 * 600000<I≤1000000时，高于600000元的部分按1.5%提成；
 * I>1000000时，超过1000000元的部分按1%提成。
 *
 * 从键盘输入当月利润I,求应发奖金总数。
 *
 * 输入格式
 * 一个整数，当月利润。
 *
 * 输出格式
 * 一个整数，奖金。
 *
 * 样例输入
 * 900
 *
 * 样例输出
 * 90
 *
 * @author Ryanlin
 */
public class ProfitCalculation {
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);
        int lr = sc.nextInt();
        if(lr <= 100000)    {
            System.out.println("奖金总数 = " + (lr * 0.1));
        } else if (lr > 100000 && lr <= 200000) {
            System.out.println("奖金总数 = " + (100000 * 0.1 + (lr-100000) * 0.075));
        } else if (lr >200000 && lr <= 400000) {
            System.out.println("奖金总数 = " + (100000 * (0.1 + 0.075) + (lr - 200000) * 0.05));
        } else if (lr >400000 && lr <= 600000) {
            System.out.println("奖金总数 = " + (100000 * (0.1 + 0.075) + (lr - 400000) * 0.03 + 200000 * 0.05));
        } else if (lr >600000 && lr <= 1000000) {
            System.out.println("奖金总数 = " + (100000 * (0.1 + 0.075) + (lr - 600000) * 0.015 + 200000 * (0.05+0.03)));
        } else if (lr >1000000) {
            System.out.println("奖金总数 = " + (100000 * (0.1 + 0.075) + (lr - 1000000) * 0.01 + 200000 * (0.05+0.03) + 400000 * 0.015));
        }
    }
}
